pratikshinde/CNC-Tool-Monitoring/sdkconfig.defaults
# CNC Tool Monitor — build defaults
# Target: ESP32 (WROVER-E / WROOM-32E with 16 MB flash)
# ESP-IDF: v6.0.2

CONFIG_IDF_TARGET="esp32"

# ---- Flash --------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# ---- Partitions ---------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---- OTA rollback (OTA-R2) ---------------------------------------------
# The app must explicitly call esp_ota_mark_app_valid_cancel_rollback() once
# it has proved itself healthy, otherwise the bootloader reverts on next boot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ---- Watchdogs (DO-R3, DG-R5) ------------------------------------------
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_INT_WDT=y

# ---- FreeRTOS -----------------------------------------------------------
# 1 kHz tick: the alarm engine reasons in milliseconds and a 100 Hz tick
# would quantise the on/off delays too coarsely to hit NFR-1.
CONFIG_FREERTOS_HZ=1000

# ---- Logging ------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ---- Compiler -----------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y

# ---- Brown-out ----------------------------------------------------------
# Outputs must reach their safe state before the rails collapse (DO-R5).
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
